Repository: eidibrahem/mini_commerce
Catalog: lib/core/localization/l10n/app_*.arb
Languages: ar

source: Products
ar: المنتجات

source: Search products...
ar: البحث عن المنتجات...

source: All
ar: الكل

source: Electronics
ar: الإلكترونيات

source: Clothing
ar: الملابس

source: Books
ar: الكتب

source: Home
ar: المنزل

source: No products found
ar: لم يتم العثور على منتجات

source: Retry
ar: إعادة المحاولة

source: Cart
ar: عربة التسوق

source: Profile
ar: الملف الشخصي

source: Add to Cart
ar: أضف إلى عربة التسوق

source: Remove from Cart
ar: إزالة من عربة التسوق

source: Quantity
ar: الكمية

source: Total
ar: المجموع

source: Checkout
ar: إتمام الشراء

source: Proceed to Checkout
ar: المتابعة إلى إتمام الشراء

# paymentSuccessful
source: Payment successful! Order confirmed for
ar: تم الدفع بنجاح! تم تأكيد الطلب مقابل

source: Payment failed
ar: فشل الدفع

source: User not authenticated
ar: المستخدم غير مصادق عليه

source: Loading...
ar: جاري التحميل...

source: Error
ar: خطأ

source: Success
ar: نجح

source: Cancel
ar: إلغاء

source: Save
ar: حفظ

source: Edit
ar: تعديل

source: Delete
ar: حذف

source: Confirm
ar: تأكيد

source: Clear Cart
ar: مسح عربة التسوق

# clearCartConfirmation
source: Are you sure you want to clear your cart?
ar: هل أنت متأكد من أنك تريد مسح عربة التسوق؟

source: Yes
ar: نعم

source: No
ar: لا

# emptyCart
source: Your cart is empty
ar: عربة التسوق فارغة

source: Cart Summary
ar: ملخص عربة التسوق

source: Subtotal
ar: المجموع الفرعي

source: Tax
ar: الضريبة

source: Shipping
ar: الشحن

source: Total Amount
ar: المبلغ الإجمالي

source: Item Count
ar: عدد العناصر

source: Items
ar: العناصر

source: Processing checkout...
ar: جاري معالجة إتمام الشراء...

source: Order confirmed
ar: تم تأكيد الطلب

source: Order failed
ar: فشل الطلب

source: Product Details
ar: تفاصيل المنتج

source: Product Rating
ar: تقييم المنتج

source: Product Description
ar: وصف المنتج

# productCategory
source: Category
ar: الفئة

# productPrice
source: Price
ar: السعر

# productStock
source: Stock
ar: المخزون

# productAvailability
source: Availability
ar: التوفر

source: Available
ar: متوفر

source: Out of Stock
ar: نفذ من المخزون

# productTags
source: Tags
ar: العلامات

# productReviews
source: Reviews
ar: التقييمات

# productImages
source: Images
ar: الصور

# productGallery
source: Gallery
ar: المعرض

# productZoom
source: Zoom
ar: تكبير

# productFullScreen
source: Full Screen
ar: ملء الشاشة

# productClose
source: Close
ar: إغلاق

# productNext
source: Next
ar: التالي

# productPrevious
source: Previous
ar: السابق

# productImage
source: Image
ar: صورة

# productImageCount
source: Image {current} of {total}
ar: صورة {current} من {total}

# productRatingStars
source: {rating} out of 5 stars
ar: {rating} من 5 نجوم

# productRatingCount
source: ({count} reviews)
ar: ({count} تقييم)

# productRatingEmpty
source: No reviews yet
ar: لا توجد تقييمات بعد

# productRatingHalf
source: Half star
ar: نصف نجمة

# productRatingFull
source: Full star
ar: نجمة كاملة

# productRatingEmptyStar
source: Empty star
ar: نجمة فارغة

# productAddToCartSuccess
source: Added to cart successfully!
ar: تمت الإضافة إلى عربة التسوق بنجاح!

# productAddToCartError
source: Failed to add to cart
ar: فشل في إضافة المنتج إلى عربة التسوق

# productAlreadyInCart
source: Product is already in cart
ar: المنتج موجود بالفعل في عربة التسوق

# productQuantityUpdated
source: Quantity updated
ar: تم تحديث الكمية

# productQuantityError
source: Failed to update quantity
ar: فشل في تحديث الكمية

source: Product removed from cart
ar: تم إزالة المنتج من عربة التسوق

# productRemoveError
source: Failed to remove product
ar: فشل في إزالة المنتج

# productCartUpdated
source: Cart updated
ar: تم تحديث عربة التسوق

# productCartError
source: Failed to update cart
ar: فشل في تحديث عربة التسوق

# productCartCleared
source: Cart cleared
ar: تم مسح عربة التسوق

# productCartClearError
source: Failed to clear cart
ar: فشل في مسح عربة التسوق

# productCartLoaded
source: Cart loaded
ar: تم تحميل عربة التسوق

# productCartLoadError
source: Failed to load cart
ar: فشل في تحميل عربة التسوق

# productCartEmpty
source: Cart is empty
ar: عربة التسوق فارغة

# productCartNotEmpty
source: Cart has items
ar: عربة التسوق تحتوي على عناصر

# productCartTotal
source: Cart total
ar: مجموع عربة التسوق

# productCartCount
source: Cart count
ar: عدد عناصر عربة التسوق

# productCartItem
source: Cart item
ar: عنصر عربة التسوق

# productCartItems
source: Cart items
ar: عناصر عربة التسوق

# productCartItemCount
source: Cart item count
ar: عدد عناصر عربة التسوق

# productCartItemTotal
source: Cart item total
ar: مجموع عنصر عربة التسوق

# productCartItemPrice
source: Cart item price
ar: سعر عنصر عربة التسوق

# productCartItemQuantity
source: Cart item quantity
ar: كمية عنصر عربة التسوق

# productCartItemName
source: Cart item name
ar: اسم عنصر عربة التسوق

# productCartItemImage
source: Cart item image
ar: صورة عنصر عربة التسوق

# productCartItemCategory
source: Cart item category
ar: فئة عنصر عربة التسوق

# productCartItemDescription
source: Cart item description
ar: وصف عنصر عربة التسوق

# productCartItemRating
source: Cart item rating
ar: تقييم عنصر عربة التسوق

# productCartItemReviews
source: Cart item reviews
ar: تقييمات عنصر عربة التسوق

# productCartItemStock
source: Cart item stock
ar: مخزون عنصر عربة التسوق

# productCartItemAvailability
source: Cart item availability
ar: توفر عنصر عربة التسوق

# productCartItemTags
source: Cart item tags
ar: علامات عنصر عربة التسوق

# productCartItemCreated
source: Cart item created
ar: تم إنشاء عنصر عربة التسوق

# productCartItemUpdated
source: Cart item updated
ar: تم تحديث عنصر عربة التسوق

# productCartItemDeleted
source: Cart item deleted
ar: تم حذف عنصر عربة التسوق

# productCartItemAdded
source: Cart item added
ar: تم إضافة عنصر عربة التسوق

# productCartItemRemoved
source: Cart item removed
ar: تم إزالة عنصر عربة التسوق

# productCartItemUpdatedQuantity
source: Cart item quantity updated
ar: تم تحديث كمية عنصر عربة التسوق

# productCartItemCleared
source: Cart item cleared
ar: تم مسح عنصر عربة التسوق

# productCartItemLoadError
source: Failed to load cart item
ar: فشل في تحميل عنصر عربة التسوق

# productCartItemSaveError
source: Failed to save cart item
ar: فشل في حفظ عنصر عربة التسوق

# productCartItemDeleteError
source: Failed to delete cart item
ar: فشل في حذف عنصر عربة التسوق

# productCartItemUpdateError
source: Failed to update cart item
ar: فشل في تحديث عنصر عربة التسوق

# productCartItemAddError
source: Failed to add cart item
ar: فشل في إضافة عنصر عربة التسوق

# productCartItemRemoveError
source: Failed to remove cart item
ar: فشل في إزالة عنصر عربة التسوق

# productCartItemClearError
source: Failed to clear cart item
ar: فشل في مسح عنصر عربة التسوق

# productCartItemQuantityError
source: Failed to update cart item quantity
ar: فشل في تحديث كمية عنصر عربة التسوق

# productCartItemTotalError
source: Failed to calculate cart item total
ar: فشل في حساب مجموع عنصر عربة التسوق

# productCartItemCountError
source: Failed to count cart items
ar: فشل في عد عناصر عربة التسوق

# productCartItemLoadSuccess
source: Cart item loaded successfully
ar: تم تحميل عنصر عربة التسوق بنجاح

# productCartItemSaveSuccess
source: Cart item saved successfully
ar: تم حفظ عنصر عربة التسوق بنجاح

# productCartItemDeleteSuccess
source: Cart item deleted successfully
ar: تم حذف عنصر عربة التسوق بنجاح

# productCartItemUpdateSuccess
source: Cart item updated successfully
ar: تم تحديث عنصر عربة التسوق بنجاح

# productCartItemAddSuccess
source: Cart item added successfully
ar: تم إضافة عنصر عربة التسوق بنجاح

# productCartItemRemoveSuccess
source: Cart item removed successfully
ar: تم إزالة عنصر عربة التسوق بنجاح

# productCartItemClearSuccess
source: Cart item cleared successfully
ar: تم مسح عنصر عربة التسوق بنجاح

# productCartItemQuantitySuccess
source: Cart item quantity updated successfully
ar: تم تحديث كمية عنصر عربة التسوق بنجاح

# productCartItemTotalSuccess
source: Cart item total calculated successfully
ar: تم حساب مجموع عنصر عربة التسوق بنجاح

# productCartItemCountSuccess
source: Cart item count calculated successfully
ar: تم حساب عدد عناصر عربة التسوق بنجاح

# productCartItemLoadInfo
source: Loading cart item...
ar: جاري تحميل عنصر عربة التسوق...

# productCartItemSaveInfo
source: Saving cart item...
ar: جاري حفظ عنصر عربة التسوق...

# productCartItemDeleteInfo
source: Deleting cart item...
ar: جاري حذف عنصر عربة التسوق...

# productCartItemUpdateInfo
source: Updating cart item...
ar: جاري تحديث عنصر عربة التسوق...

# productCartItemAddInfo
source: Adding cart item...
ar: جاري إضافة عنصر عربة التسوق...

# productCartItemRemoveInfo
source: Removing cart item...
ar: جاري إزالة عنصر عربة التسوق...

# productCartItemClearInfo
source: Clearing cart item...
ar: جاري مسح عنصر عربة التسوق...

# productCartItemQuantityInfo
source: Updating cart item quantity...
ar: جاري تحديث كمية عنصر عربة التسوق...

# productCartItemTotalInfo
source: Calculating cart item total...
ar: جاري حساب مجموع عنصر عربة التسوق...

# productCartItemCountInfo
source: Counting cart items...
ar: جاري عد عناصر عربة التسوق...

source: Language
ar: اللغة

source: English
ar: الإنجليزية

source: Arabic
ar: العربية

source: Change Language
ar: تغيير اللغة

source: Select Language
ar: اختر اللغة

source: Current Language
ar: اللغة الحالية

source: Language changed
ar: تم تغيير اللغة

# languageChangeError
source: Failed to change language
ar: فشل في تغيير اللغة

# languageChangeSuccess
source: Language changed successfully
ar: تم تغيير اللغة بنجاح

# languageChangeInfo
source: Changing language...
ar: جاري تغيير اللغة...

# languageChangeConfirm
source: Are you sure you want to change the language?
ar: هل أنت متأكد من أنك تريد تغيير اللغة؟

# languageChangeCancel
source: Cancel language change
ar: إلغاء تغيير اللغة

# languageChangeSave
source: Save language change
ar: حفظ تغيير اللغة

# languageChangeReset
source: Reset language
ar: إعادة تعيين اللغة

# languageChangeDefault
source: Default language
ar: اللغة الافتراضية

# languageChangeCustom
source: Custom language
ar: لغة مخصصة

# languageChangeSystem
source: System language
ar: لغة النظام

# languageChangeUser
source: User language
ar: لغة المستخدم

# languageChangeApp
source: App language
ar: لغة التطبيق

# languageChangeDevice
source: Device language
ar: لغة الجهاز

# languageChangeLocale
source: Locale language
ar: لغة المنطقة

# languageChangeRegion
source: Region language
ar: لغة المنطقة

# languageChangeCountry
source: Country language
ar: لغة البلد

# languageChangeCurrency
source: Currency language
ar: لغة العملة

# languageChangeFormat
source: Format language
ar: لغة التنسيق

# languageChangeDirection
source: Direction language
ar: لغة الاتجاه

# languageChangeRTL
source: Right to Left
ar: من اليمين إلى اليسار

# languageChangeLTR
source: Left to Right
ar: من اليسار إلى اليمين

# languageChangeAuto
source: Auto
ar: تلقائي

# languageChangeManual
source: Manual
ar: يدوي

# languageChangeOn
source: On
ar: تشغيل

# languageChangeOff
source: Off
ar: إيقاف

# languageChangeEnabled
source: Enabled
ar: مفعل

# languageChangeDisabled
source: Disabled
ar: معطل

# languageChangeActive
source: Active
ar: نشط

# languageChangeInactive
source: Inactive
ar: غير نشط

# languageChangePrimary
source: Primary
ar: أولي

# languageChangeSecondary
source: Secondary
ar: ثانوي

# languageChangeTertiary
source: Tertiary
ar: ثالث

# languageChangeQuaternary
source: Quaternary
ar: رابع

# languageChangeQuinary
source: Quinary
ar: خامس

# languageChangeSenary
source: Senary
ar: سادس

# languageChangeSeptenary
source: Septenary
ar: سابع

# languageChangeOctonary
source: Octonary
ar: ثامن

# languageChangeNonary
source: Nonary
ar: تاسع

# languageChangeDenary
source: Denary
ar: عاشر

source: Map
ar: الخريطة
